# Dataframe

*Cominations of Series*

In [1]:
import pandas as pd
import numpy as np

In [4]:
data = {
    "Name" : ["Tejas", "Akash", "Suraj"],
    "Age" : [24, 23, 25],
    "City" : ["Nagpur", "Pune", "Akola"],
    "Salary" : [170000, 130000, 120000]
}
df = pd.DataFrame(data)
df

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [9]:
data_list = [
    ["Tejas", 24, "Nagpur", 170000],
    ["Akash", 23, "Pune", 130000],
    ["Suraj", 25, "Akola", 120000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

**Selection and Indexing of Columns**

In [10]:
df2

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [12]:
df2[["Name", "City"]]

    Name    City
0  Tejas  Nagpur
1  Akash    Pune
2  Suraj   Akola

**Creating a new column**

In [ ]:
df2["Designation"] = ["Data Engineer", "Software Developer", "ML Engineer"]
df2